; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob46) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 depot1)
	(clear crate5)
	(at pallet2 depot2)
	(clear crate9)
	(at pallet3 distributor0)
	(clear crate1)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot1)
	(clear pallet6)
	(at pallet7 depot2)
	(clear pallet7)
	(at pallet8 depot0)
	(clear crate2)
	(at pallet9 depot0)
	(clear crate4)
	(at pallet10 distributor2)
	(clear crate6)
	(at truck0 depot1)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 distributor0)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at hoist9 depot1)
	(available hoist9)
	(at hoist10 depot2)
	(available hoist10)
	(at hoist11 distributor2)
	(available hoist11)
	(at hoist12 distributor1)
	(available hoist12)
	(at crate0 depot0)
	(on crate0 pallet8)
	(at crate1 distributor0)
	(on crate1 pallet3)
	(at crate2 depot0)
	(on crate2 crate0)
	(at crate3 depot0)
	(on crate3 pallet0)
	(at crate4 depot0)
	(on crate4 pallet9)
	(at crate5 depot1)
	(on crate5 pallet1)
	(at crate6 distributor2)
	(on crate6 pallet10)
	(at crate7 depot0)
	(on crate7 crate3)
	(at crate8 depot2)
	(on crate8 pallet2)
	(at crate9 depot2)
	(on crate9 crate8)
)

(:goal (and
		(on crate0 crate3)
		(on crate1 crate2)
		(on crate2 pallet9)
		(on crate3 pallet6)
		(on crate4 pallet10)
		(on crate5 pallet7)
		(on crate6 crate5)
		(on crate7 crate4)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 0 of 8
2. (lift hoist7 crate1 pallet3 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist7) (on crate1 pallet3)
   added: (lifting hoist7 crate1) (clear pallet3)
   goals met: 0 of 8
3. (lift hoist5 crate6 pallet10 distributor2)
   deleted: (at crate6 distributor2) (clear crate6) (available hoist5) (on crate6 pallet10)
   added: (lifting hoist5 crate6) (clear pallet10)
   goals met: 0 of 8
4. (lift hoist8 crate2 crate0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist8) (on crate2 crate0)
   added: (lifting hoist8 crate2) (clear crate0)
   goals met: 0 of 8
5. (lift hoist9 crate5 pallet1 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist9) (on crate5 pallet1)
   added: (lifting hoist9 crate5) (clear pallet1)
   goals met: 0 of 8
6. (load hoist9 crate5 truck0 depot1)
   deleted: (lifting hoist9 crate5)
   added: (in crate5 truck0) (available hoist9)
   goals met: 0 of 8
7. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 0 of 8
8. (unload hoist2 crate5 truck0 depot2)
   deleted: (in crate5 truck0) (available hoist2)
   added: (lifting hoist2 crate5)
   goals met: 0 of 8
9. (drop hoist2 crate5 pallet7 depot2)
   deleted: (lifting hoist2 crate5) (clear pallet7)
   added: (available hoist2) (at crate5 depot2) (clear crate5) (on crate5 pallet7)
   goals met: 1 of 8
10. (load hoist8 crate2 truck1 depot0)
   deleted: (lifting hoist8 crate2)
   added: (in crate2 truck1) (available hoist8)
   goals met: 1 of 8
11. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 1 of 8
12. (unload hoist8 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist8)
   added: (lifting hoist8 crate2)
   goals met: 1 of 8
13. (load hoist5 crate6 truck0 distributor2)
   deleted: (lifting hoist5 crate6)
   added: (in crate6 truck0) (available hoist5)
   goals met: 1 of 8
14. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 1 of 8
15. (unload hoist2 crate6 truck0 depot2)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   goals met: 1 of 8
16. (drop hoist2 crate6 crate5 depot2)
   deleted: (lifting hoist2 crate6) (clear crate5)
   added: (available hoist2) (at crate6 depot2) (clear crate6) (on crate6 crate5)
   goals met: 2 of 8
17. (load hoist8 crate2 truck1 depot0)
   deleted: (lifting hoist8 crate2)
   added: (in crate2 truck1) (available hoist8)
   goals met: 2 of 8
18. (lift hoist8 crate7 crate3 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist8) (on crate7 crate3)
   added: (lifting hoist8 crate7) (clear crate3)
   goals met: 2 of 8
19. (drop hoist8 crate7 crate4 depot0)
   deleted: (lifting hoist8 crate7) (clear crate4)
   added: (available hoist8) (at crate7 depot0) (clear crate7) (on crate7 crate4)
   goals met: 3 of 8
20. (lift hoist8 crate0 pallet8 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist8) (on crate0 pallet8)
   added: (lifting hoist8 crate0) (clear pallet8)
   goals met: 3 of 8
21. (drop hoist8 crate0 crate3 depot0)
   deleted: (lifting hoist8 crate0) (clear crate3)
   added: (available hoist8) (at crate0 depot0) (clear crate0) (on crate0 crate3)
   goals met: 4 of 8
22. (unload hoist8 crate2 truck1 depot0)
   deleted: (in crate2 truck1) (available hoist8)
   added: (lifting hoist8 crate2)
   goals met: 4 of 8
23. (drop hoist8 crate2 pallet8 depot0)
   deleted: (lifting hoist8 crate2) (clear pallet8)
   added: (available hoist8) (at crate2 depot0) (clear crate2) (on crate2 pallet8)
   goals met: 4 of 8
24. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 4 of 8
25. (load hoist7 crate1 truck0 distributor0)
   deleted: (lifting hoist7 crate1)
   added: (in crate1 truck0) (available hoist7)
   goals met: 4 of 8
26. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 4 of 8
27. (unload hoist8 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist8)
   added: (lifting hoist8 crate1)
   goals met: 4 of 8
28. (drop hoist8 crate1 crate2 depot0)
   deleted: (lifting hoist8 crate1) (clear crate2)
   added: (available hoist8) (at crate1 depot0) (clear crate1) (on crate1 crate2)
   goals met: 5 of 8
29. (lift hoist8 crate7 crate4 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist8) (on crate7 crate4)
   added: (lifting hoist8 crate7) (clear crate4)
   goals met: 4 of 8
30. (lift hoist0 crate4 pallet9 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 pallet9)
   added: (lifting hoist0 crate4) (clear pallet9)
   goals met: 4 of 8
31. (load hoist8 crate7 truck1 depot0)
   deleted: (lifting hoist8 crate7)
   added: (in crate7 truck1) (available hoist8)
   goals met: 4 of 8
32. (load hoist0 crate4 truck1 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck1) (available hoist0)
   goals met: 4 of 8
33. (drive truck1 depot0 distributor2)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor2)
   goals met: 4 of 8
34. (unload hoist5 crate4 truck1 distributor2)
   deleted: (in crate4 truck1) (available hoist5)
   added: (lifting hoist5 crate4)
   goals met: 4 of 8
35. (unload hoist11 crate7 truck1 distributor2)
   deleted: (in crate7 truck1) (available hoist11)
   added: (lifting hoist11 crate7)
   goals met: 4 of 8
36. (drop hoist5 crate4 pallet10 distributor2)
   deleted: (lifting hoist5 crate4) (clear pallet10)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 pallet10)
   goals met: 5 of 8
37. (drop hoist11 crate7 crate4 distributor2)
   deleted: (lifting hoist11 crate7) (clear crate4)
   added: (available hoist11) (at crate7 distributor2) (clear crate7) (on crate7 crate4)
   goals met: 6 of 8
38. (lift hoist8 crate1 crate2 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist8) (on crate1 crate2)
   added: (lifting hoist8 crate1) (clear crate2)
   goals met: 5 of 8
39. (lift hoist0 crate0 crate3 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 crate3)
   added: (lifting hoist0 crate0) (clear crate3)
   goals met: 4 of 8
40. (load hoist8 crate1 truck0 depot0)
   deleted: (lifting hoist8 crate1)
   added: (in crate1 truck0) (available hoist8)
   goals met: 4 of 8
41. (drop hoist0 crate0 crate3 depot0)
   deleted: (lifting hoist0 crate0) (clear crate3)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate3)
   goals met: 5 of 8
42. (lift hoist8 crate2 pallet8 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist8) (on crate2 pallet8)
   added: (lifting hoist8 crate2) (clear pallet8)
   goals met: 5 of 8
43. (drop hoist8 crate2 pallet9 depot0)
   deleted: (lifting hoist8 crate2) (clear pallet9)
   added: (available hoist8) (at crate2 depot0) (clear crate2) (on crate2 pallet9)
   goals met: 6 of 8
44. (unload hoist8 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist8)
   added: (lifting hoist8 crate1)
   goals met: 6 of 8
45. (drop hoist8 crate1 crate2 depot0)
   deleted: (lifting hoist8 crate1) (clear crate2)
   added: (available hoist8) (at crate1 depot0) (clear crate1) (on crate1 crate2)
   goals met: 7 of 8
46. (lift hoist8 crate0 crate3 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist8) (on crate0 crate3)
   added: (lifting hoist8 crate0) (clear crate3)
   goals met: 6 of 8
47. (lift hoist0 crate3 pallet0 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet0)
   added: (lifting hoist0 crate3) (clear pallet0)
   goals met: 6 of 8
48. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   goals met: 6 of 8
49. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 6 of 8
50. (unload hoist9 crate3 truck0 depot1)
   deleted: (in crate3 truck0) (available hoist9)
   added: (lifting hoist9 crate3)
   goals met: 6 of 8
51. (drop hoist9 crate3 pallet6 depot1)
   deleted: (lifting hoist9 crate3) (clear pallet6)
   added: (available hoist9) (at crate3 depot1) (clear crate3) (on crate3 pallet6)
   goals met: 7 of 8
52. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 7 of 8
53. (load hoist8 crate0 truck0 depot0)
   deleted: (lifting hoist8 crate0)
   added: (in crate0 truck0) (available hoist8)
   goals met: 7 of 8
54. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 7 of 8
55. (unload hoist9 crate0 truck0 depot1)
   deleted: (in crate0 truck0) (available hoist9)
   added: (lifting hoist9 crate0)
   goals met: 7 of 8
56. (drop hoist9 crate0 crate3 depot1)
   deleted: (lifting hoist9 crate0) (clear crate3)
   added: (available hoist9) (at crate0 depot1) (clear crate0) (on crate0 crate3)
   goals met: 8 of 8
